In [14]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv("websites.csv", header=None, names=['id', 'url', 'cat'])

In [4]:
data = data[['url', 'cat']]

In [5]:
data.head()

                                                 url    cat
0                   http://www.liquidgeneration.com/  Adult
1                        http://www.onlineanime.org/  Adult
2  http://www.ceres.dti.ne.jp/~nekoi/senno/senfir...  Adult
3                         http://www.galeon.com/kmh/  Adult
4                        http://www.fanworkrecs.com/  Adult

In [6]:
data.shape[0] # number of entries, 1'562'978

1562978

In [7]:
data.cat.nunique() # number of categories

15

In [8]:
data.cat.value_counts() # number of samples in each categories

Arts          253840
Society       243943
Business      240177
Computers     117962
Science       110286
Recreation    106586
Sports        101328
Shopping       95270
Health         60097
Reference      58247
Games          56477
Kids           46182
Adult          35325
Home           28269
News            8989
Name: cat, dtype: int64

In [23]:
cat_size = 10_000
red_id = np.array([])
for cat in ['Arts', 'Computers', 'Sports', 'Kids', 'Science']:
    sub_id = data[data.cat==cat].index.values
    red_id = np.append(red_id, np.random.choice(sub_id, replace=False, size=cat_size))

In [24]:
red_data = data.iloc[red_id.tolist()]

In [25]:
red_data

                                                       url      cat
133292                http://www.imdb.com/title/tt0044207/     Arts
126451       http://www.missgien.net/misc/films/robin.html     Arts
252430                                http://www.ppmag.com     Arts
261535                 http://us.imdb.com/title/tt0103488/     Arts
125161            http://www.hollywoodjesus.com/powder.htm     Arts
...                                                    ...      ...
1089710  http://www-sul.stanford.edu/depts/ssrg/misc/ra...  Science
1115352                         http://www.bowden-bros.com  Science
1046715  http://www.botany.hawaii.edu/faculty/carr/imag...  Science
1055812                http://chem4823.usask.ca/howto.html  Science
1058504                                http://www.msls.org  Science

[50000 rows x 2 columns]

In [26]:
red_data.cat.value_counts()

Computers    10000
Kids         10000
Sports       10000
Arts         10000
Science      10000
Name: cat, dtype: int64

In [27]:
red_data.to_csv('websites_10_000_5cat.csv')